# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
na = np.random.randint(1, high=4, size=100)
nb = np.random.randint(1, high=3, size=100)
nc = np.random.randint(10000, high=30000, size=100)

In [3]:
a = pd.Series(na)
b = pd.Series(nb)
c = pd.Series(nc)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df_obj = {'a': a, 'b': b, 'c': c}
df = pd.DataFrame(data=df_obj)
df.head()

   a  b      c
0  1  2  21375
1  1  1  18619
2  1  2  18746
3  3  1  14110
4  1  1  26545

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
df.rename(columns={'a':'bedrs', 'b':'bathrs','c':'price_sqr_meter'}, inplace=True)

In [6]:
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            21375
1      1       1            18619
2      1       2            18746
3      3       1            14110
4      1       1            26545

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [15]:
oneCol = pd.concat([a,b,c], axis=0)
bigCol = oneCol.to_frame()
print(type(bigCol))

<class 'pandas.core.frame.DataFrame'>

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [16]:
len(oneCol)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [17]:
bigCol.reset_index(inplace=True, drop=True)

In [18]:
bigCol

         0
0        1
1        1
2        1
3        3
4        1
5        1
6        3
7        1
8        3
9        2
10       1
11       3
12       1
13       3
14       1
15       2
16       2
17       1
18       1
19       3
20       2
21       3
22       1
23       3
24       3
25       3
26       1
27       3
28       3
29       1
..     ...
270  20788
271  25372
272  16717
273  16854
274  18657
275  14981
276  13374
277  22856
278  14785
279  19689
280  20195
281  15718
282  22471
283  12138
284  27931
285  25572
286  28536
287  27743
288  15738
289  22366
290  17590
291  27957
292  19867
293  19332
294  11729
295  20632
296  15712
297  18281
298  24152
299  28185

[300 rows x 1 columns]